; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?x ?y)
		(car ?c)
		(location ?l)
		(at-ferry ?l)
		(at ?c ?l)
		(empty-ferry)
		(on ?c))

   (:action sail
       :parameters  (?from ?to)
       :precondition (and (not-eq ?from ?to) 
                          (location ?from) (location ?to) (at-ferry ?from))
       :effect (and  (at-ferry ?to)
		     (not (at-ferry ?from))))


   (:action board
       :parameters (?car ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters  (?car  ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (on ?car) (at-ferry ?loc))
       :effect (and (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-l7-c5)
(:domain ferry)
(:objects l0 l1 l2 l3 l4 l5 l6 
          c0 c1 c2 c3 c4 
)
(:init
(location l0)
(location l1)
(location l2)
(location l3)
(location l4)
(location l5)
(location l6)
(car c0)
(car c1)
(car c2)
(car c3)
(car c4)
(not-eq l0 l1)
(not-eq l1 l0)
(not-eq l0 l2)
(not-eq l2 l0)
(not-eq l0 l3)
(not-eq l3 l0)
(not-eq l0 l4)
(not-eq l4 l0)
(not-eq l0 l5)
(not-eq l5 l0)
(not-eq l0 l6)
(not-eq l6 l0)
(not-eq l1 l2)
(not-eq l2 l1)
(not-eq l1 l3)
(not-eq l3 l1)
(not-eq l1 l4)
(not-eq l4 l1)
(not-eq l1 l5)
(not-eq l5 l1)
(not-eq l1 l6)
(not-eq l6 l1)
(not-eq l2 l3)
(not-eq l3 l2)
(not-eq l2 l4)
(not-eq l4 l2)
(not-eq l2 l5)
(not-eq l5 l2)
(not-eq l2 l6)
(not-eq l6 l2)
(not-eq l3 l4)
(not-eq l4 l3)
(not-eq l3 l5)
(not-eq l5 l3)
(not-eq l3 l6)
(not-eq l6 l3)
(not-eq l4 l5)
(not-eq l5 l4)
(not-eq l4 l6)
(not-eq l6 l4)
(not-eq l5 l6)
(not-eq l6 l5)
(empty-ferry)
(at c0 l2)
(at c1 l6)
(at c2 l3)
(at c3 l6)
(at c4 l6)
(at-ferry l6)
)
(:goal
(and
(at c0 l1)
(at c1 l2)
(at c2 l0)
(at c3 l4)
(at c4 l3)
)
)
)

; plan
1. (board c4 l6)
   deleted: (at c4 l6) (empty-ferry)
   added: (on c4)
   goals met: 0 of 5
2. (sail l6 l3)
   deleted: (at-ferry l6)
   added: (at-ferry l3)
   goals met: 0 of 5
3. (debark c4 l3)
   deleted: (on c4)
   added: (at c4 l3) (empty-ferry)
   goals met: 1 of 5
4. (board c2 l3)
   deleted: (at c2 l3) (empty-ferry)
   added: (on c2)
   goals met: 1 of 5
5. (sail l3 l0)
   deleted: (at-ferry l3)
   added: (at-ferry l0)
   goals met: 1 of 5
6. (debark c2 l0)
   deleted: (on c2)
   added: (at c2 l0) (empty-ferry)
   goals met: 2 of 5
7. (sail l0 l4)
   deleted: (at-ferry l0)
   added: (at-ferry l4)
   goals met: 2 of 5
8. (sail l4 l2)
   deleted: (at-ferry l4)
   added: (at-ferry l2)
   goals met: 2 of 5
9. (board c0 l2)
   deleted: (at c0 l2) (empty-ferry)
   added: (on c0)
   goals met: 2 of 5
10. (sail l2 l1)
   deleted: (at-ferry l2)
   added: (at-ferry l1)
   goals met: 2 of 5
11. (debark c0 l1)
   deleted: (on c0)
   added: (at c0 l1) (empty-ferry)
   goals met: 3 of 5
12. (sail l1 l4)
   deleted: (at-ferry l1)
   added: (at-ferry l4)
   goals met: 3 of 5
13. (sail l4 l6)
   deleted: (at-ferry l4)
   added: (at-ferry l6)
   goals met: 3 of 5
14. (board c3 l6)
   deleted: (at c3 l6) (empty-ferry)
   added: (on c3)
   goals met: 3 of 5
15. (sail l6 l4)
   deleted: (at-ferry l6)
   added: (at-ferry l4)
   goals met: 3 of 5
16. (debark c3 l4)
   deleted: (on c3)
   added: (at c3 l4) (empty-ferry)
   goals met: 4 of 5
17. (sail l4 l2)
   deleted: (at-ferry l4)
   added: (at-ferry l2)
   goals met: 4 of 5
18. (sail l2 l6)
   deleted: (at-ferry l2)
   added: (at-ferry l6)
   goals met: 4 of 5
19. (board c1 l6)
   deleted: (at c1 l6) (empty-ferry)
   added: (on c1)
   goals met: 4 of 5
20. (sail l6 l2)
   deleted: (at-ferry l6)
   added: (at-ferry l2)
   goals met: 4 of 5
21. (debark c1 l2)
   deleted: (on c1)
   added: (at c1 l2) (empty-ferry)
   goals met: 5 of 5
